/*------------------------------------------
通过各类指针求二维数组的所有元素之和。
------------------------------------------*/
#include <stdio.h>

int main(void)
{
    int a[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};

    int *p[3] = {a[0], a[1], a[2]};//指针数组，按顺序存放数组每行的首地址。
    int  (*q)[4] = a;              //数组指针，加1加1行（四个元素）。
    int  **r = p;                  //指向指针的指针，初始化为指针数组的首地址。
    //在以上条件之下，p、q、r加1的性质相同。可以提替代以下四种等价形式的a
    // a[i][j]、*(a[i] + j)、*(*(a + i) +j)、(*(a + i))[j]

    int sum;
    int i,j;

    sum = 0;
    for (i = 0; i < 3; i++)
    {
        for (j = 0;j < 4; j++)
        {
            sum += *(*(r+i)+j);
        }
    }

    printf("sum = %5d\n",sum);
    return 0;

}
